<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="30,4" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>30</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="layer1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50, 4" offset="0" size="800"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="layer1.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="layer1.weight">
					<dim>50</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="MatMul_9" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_9"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>50</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_767" type="Const" version="opset1">
			<data element_type="f32" shape="1, 50" offset="800" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="7, Multiply_10"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="7">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="8" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="8"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="8">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="layer2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50, 50" offset="1000" size="10000"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="layer2.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="layer2.weight">
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="MatMul_15" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_15"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_768" type="Const" version="opset1">
			<data element_type="f32" shape="1, 50" offset="11000" size="200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="9, Multiply_16"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="9">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="10" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="10"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="10">
					<dim>30</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="layer3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="3, 50" offset="11200" size="600"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="layer3.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="layer3.weight">
					<dim>3</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="MatMul_21" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_21"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_769" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3" offset="11800" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="11, Multiply_22"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="11">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11812" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_24"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_25" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_25"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Softmax_31" type="SoftMax" version="opset8">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Softmax_31"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ShapeOf_32" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_32"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="12" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="12"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="12">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="12/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="12/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="14" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<Runtime_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<legacy_path value="False"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="False"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<input_model value="DIR/model.onnx"/>
			<input_model_is_text value="False"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<layout value="()"/>
			<layout_values value="{}"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
